In [24]:
import pandas as pd

# create dataframe

In [25]:
data = {
    'Name': ['Amy','Rambo','Pilea','Singa','David','Dambo','Yuva'],
    'Age': [23,24,42,35,45,46,56,],
    'Score': [34,45,54,65,74,67,85],
    'Gender':['F','M','F','M','M','M','M']
}
df1 = pd.DataFrame(data = data)
row_labels = [101,102,103,104,105,106,107]

In [26]:
df1

    Name  Age  Score Gender
0    Amy   23     34      F
1  Rambo   24     45      M
2  Pilea   42     54      F
3  Singa   35     65      M
4  David   45     74      M
5  Dambo   46     67      M
6   Yuva   56     85      M

In [27]:
result = df1.to_json(orient ='records')
result

'[{"Name":"Amy","Age":23,"Score":34,"Gender":"F"},{"Name":"Rambo","Age":24,"Score":45,"Gender":"M"},{"Name":"Pilea","Age":42,"Score":54,"Gender":"F"},{"Name":"Singa","Age":35,"Score":65,"Gender":"M"},{"Name":"David","Age":45,"Score":74,"Gender":"M"},{"Name":"Dambo","Age":46,"Score":67,"Gender":"M"},{"Name":"Yuva","Age":56,"Score":85,"Gender":"M"}]'

In [28]:
df1['square_age'] = df1['Age'].apply(lambda x:x**2)
result = df1['square_age']
result

0     529
1     576
2    1764
3    1225
4    2025
5    2116
6    3136
Name: square_age, dtype: int64